---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundariesError
source: html/61cba178-c8c0-a448-3023-a041d5ae0ca3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundariesError Property

Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairClosedBoundariesError { get; }
```